app/controllers/cornerstones_controller.rb

INSERT INTO "cornerstones" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cornerstone = Cornerstone.new(cornerstone_params)
    @cornerstone.save!

SELECT "cornerstones".* FROM "cornerstones"
---
  def index
    @cornerstones = Cornerstone.all

SELECT "cornerstones".* FROM "cornerstones"
---
  def map
    @cornerstones = Cornerstone.all